tutorials/incompressible/pimpleFoam/RAS/impeller/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00015;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(inlet|outlet)"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
